OpenFOAM-6-master/test/multiphase/reactingMultiphaseEulerFoam/populationBalanceModeling/simultaneousCoalescenceAndBreakup/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type populationBalanceMultiphaseSystem;

phases (air1 air2 air3 water);

populationBalances (bubbles);

air1
{
    type            pureIsothermalPhaseModel;
    diameterModel   velocityGroup;
    velocityGroupCoeffs
    {
        populationBalance    bubbles;

        formFactor      1;

        sizeGroups
        (
            f0 {d  1;           value 1.0;}
            f1 {d  1.080059739; value 0.0;}
            f2 {d  1.16652904;  value 0.0;}
            f3 {d  1.25992105;  value 0.0;}
            f4 {d  1.36079;     value 0.0;}
            f5 {d  1.469734492; value 0.0;}
            f6 {d  1.587401052; value 0.0;}
            f7 {d  1.714487966; value 0.0;}
            f8 {d  1.851749425; value 0.0;}
            f9 {d  2;           value 0.0;}
            f10{d  2.160119478; value 0.0;}
            f11{d  2.333058079; value 0.0;}
            f12{d  2.5198421;   value 0.0;}
        );
    }

    residualAlpha   1e-6;
}

air2
{
    type            pureIsothermalPhaseModel;
    diameterModel   velocityGroup;
    velocityGroupCoeffs
    {
        populationBalance    bubbles;

        formFactor      1;

        sizeGroups
        (
            f13{d  2.72158;     value 1.0;}
            f14{d  2.939468985; value 0.0;}
            f15{d  3.174802104; value 0.0;}
            f16{d  3.428975931; value 0.0;}
            f17{d  3.703498849; value 0.0;}
            f18{d  4;           value 0.0;}
            f19{d  4.320238956; value 0.0;}
            f20{d  4.666116158; value 0.0;}
            f21{d  5.0396842;   value 0.0;}
            f22{d  5.443160001; value 0.0;}
        );
    }

    residualAlpha   1e-6;
}

air3
{
    type            pureIsothermalPhaseModel;
    diameterModel   velocityGroup;
    velocityGroupCoeffs
    {
        populationBalance    bubbles;

        formFactor      1;

        sizeGroups
        (
            f23{d  5.878937969; value 1.0;}
            f24{d  6.349604208; value 0.0;}
            f25{d  6.857951863; value 0.0;}
            f26{d  7.406997698; value 0.0;}
            f27{d  8;           value 0.0;}
            f28{d  8.640477911; value 0.0;}
            f29{d  9.332232317; value 0.0;}
            f30{d  10.0793684 ; value 0.0;}
        );
    }

    residualAlpha   1e-6;
}

water
{
    type            pureIsothermalPhaseModel;
    diameterModel   constant;
    constantCoeffs
    {
        d               1e-4;
    }

    residualAlpha   1e-6;
}

populationBalanceCoeffs
{
    bubbles
    {
        continuousPhase water;

        coalescenceModels
        (
            hydrodynamic{}
        );

        binaryBreakupModels
        ();

        breakupModels
        (
            exponential
            {
                C 0.1;
                exponent 0.01;
                daughterSizeDistributionModel uniformBinary;
            }
        );

        driftModels
        ();

        nucleationModels
        ();
    }
}

blending
{
    default
    {
        type            none;
        continuousPhase water;
    }
}

surfaceTension
();

interfaceCompression
();

aspectRatio
();

drag
();

virtualMass
();

heatTransfer
();

phaseTransfer
();

lift
();

wallLubrication
();

turbulentDispersion
();

bubbleInducedTurbulence
();

// Minimum allowable pressure
pMin            10000;


// ************************************************************************* //
